<a href="https://colab.research.google.com/github/manishaachary13/Alma_study/blob/main/sqlite.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import  sqlite3
connection=sqlite3.connect("aquarium.db")
print(connection.total_changes)

0

In [4]:
sqlite3.connect(':memory:')
# cursor object
# Syntax: cursor_object=connection_object.execute(“sql query”);

In [5]:
# create a hotel database
import sqlite3
connection=sqlite3.connect("hotel_data.db")

In [ ]:
# create table
connection.execute('''create table hotel
(FIND INT PRIMARY KEY     NOT NULL,
         FNAME           TEXT    NOT NULL,
         COST            INT     NOT NULL,
         WEIGHT        INT);
''')

In [9]:
# insert values into db
connection.execute(
    '''insert into hotel values
    (1, 'cakes',800,10 ),
    (2, 'biscuits',100,20 ),
    (3, 'chocos',1000,30 )'''
)

In [11]:
print("All data in food table\n")
cursor=connection.execute("select * from hotel")
for row in cursor:
  print(row)

All data in food table

(1, 'cakes', 800, 10)
(2, 'biscuits', 100, 20)
(3, 'chocos', 1000, 30)

In [12]:
import sqlite3
connection=sqlite3.connect("alma.db")
cursor=connection.cursor()

In [19]:
# create table
# Creating table
table ="""CREATE TABLE STUDENT_DATA(NAME VARCHAR(255), CLASS VARCHAR(255),
SECTION VARCHAR(255));"""
cursor.execute(table)

In [20]:
# Queries to INSERT records.
cursor.execute('''INSERT INTO STUDENT_DATA (CLASS, SECTION, NAME)
  VALUES ('7th', 'A', 'Raju')
  ''')

cursor.execute(
  '''INSERT INTO STUDENT_DATA (SECTION, NAME, CLASS) VALUES ('B', 'Shyam', '8th')''')

cursor.execute(
  '''INSERT INTO STUDENT_DATA(NAME, CLASS, SECTION ) VALUES ('Baburao', '9th', 'C')''')

cursor.execute(
  '''INSERT INTO STUDENT_DATA(NAME, CLASS, SECTION ) VALUES ('Ajith', '9th', 'C')''')

cursor.execute(
  '''INSERT INTO STUDENT_DATA(NAME, CLASS, SECTION ) VALUES ('Karnan', '8th', 'B')''')

cursor.execute(
  '''INSERT INTO STUDENT_DATA (NAME, CLASS, SECTION ) VALUES ('Abhishek', '10th', 'A')''')
cursor.execute(
  '''INSERT INTO STUDENT_DATA (NAME, CLASS, SECTION ) VALUES ('Kishore', '9th', 'C')''')

In [23]:
# Display data inserted
print("Data Inserted in the table: ")
# * is used to refer to all columns
data=cursor.execute('''SELECT * FROM STUDENT_DATA''')
for row in data:
    print(row)

Data Inserted in the table:
('Raju', '7th', 'A')
('Shyam', '8th', 'B')
('Baburao', '9th', 'C')
('Ajith', '9th', 'C')
('Karnan', '8th', 'B')
('Abhishek', '10th', 'A')
('Kishore', '9th', 'C')

In [25]:
# Commit your changes in
# the database
connection.commit()

# Closing the connection
connection.close

In [39]:
connection=sqlite3.connect("alma.db")
cursor=connection.cursor()
cursor=cursor.execute('select * from student_data where class>"7th"')
print(cursor.fetchmany(2))
print(cursor.fetchone())
print(cursor.fetchall())
connection.commit()
connection.close()

[('Shyam', '8th', 'B'), ('Baburao', '9th', 'C')]
('Ajith', '9th', 'C')
[('Karnan', '8th', 'B'), ('Kishore', '9th', 'C')]

In [41]:
connection=sqlite3.connect("alma.db")
cursor=connection.cursor()
cursor=cursor.execute('delete from student_data where name="Kishore"')
cursor=cursor.execute('select * from student_data')
print(cursor.fetchall())
connection.commit()

[('Raju', '7th', 'A'), ('Shyam', '8th', 'B'), ('Baburao', '9th', 'C'), ('Ajith', '9th', 'C'), ('Karnan', '8th', 'B'), ('Abhishek', '10th', 'A')]

In [48]:
import pandas as pd
con=sqlite3.connect('alma.db')
df_students=pd.read_sql_query("select * from student_data",con)
print(df_students)
df_new=df_students[:-1]
print(df_new)

       NAME CLASS SECTION
0      Raju   7th       A
1     Shyam   8th       B
2   Baburao   9th       C
3     Ajith   9th       C
4    Karnan   8th       B
5  Abhishek  10th       A
      NAME CLASS SECTION
0     Raju   7th       A
1    Shyam   8th       B
2  Baburao   9th       C
3    Ajith   9th       C
4   Karnan   8th       B

In [55]:
df_new.to_sql("student11",con,if_exists="replace")
print(pd.read_sql_query("select * from student11",con))

   index     NAME CLASS SECTION
0      0     Raju   7th       A
1      1    Shyam   8th       B
2      2  Baburao   9th       C
3      3    Ajith   9th       C
4      4   Karnan   8th       B

In [ ]:
pip install pandasql
# If there is an error i.e "ObjectNotExecutableError: Not an executable object:" then run the below command and restart kernel.
# pip install SQLAlchemy==1.4.46

In [2]:
from pandasql import sqldf
import pandas as pd
df = pd.DataFrame({
    'Name': ['John', 'Jane', 'Bob', 'Mary'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'London', 'Paris', 'Sydney']
})

In [3]:
query="SELECT * FROM df"
result = sqldf(query, globals())

print(result)

   Name  Age      City
0  John   25  New York
1  Jane   30    London
2   Bob   35     Paris
3  Mary   40    Sydney

In [1]:
from pandasql import sqldf
import pandas as pd

# Create a sample DataFrame.
df = pd.DataFrame({
    'Name': ['John', 'Jane', 'Bob', 'Mary'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'London', 'Paris', 'Sydney']
})

# Define a helper function that allows sqldf to access the DataFrame in the global scope.
def run_query(query):
    return sqldf(query, globals())

# Define your SQL query.
query = "SELECT * FROM df"

# Run the query using the helper function.
result = run_query(query)

# Print the result.
print(result)

   Name  Age      City
0  John   25  New York
1  Jane   30    London
2   Bob   35     Paris
3  Mary   40    Sydney

In [ ]:
# pip list | grep pandasql
# pip install pandasql --force-reinstall
!pip install pandasql --force-reinstall

In [6]:
query="select * from df where age>=30"
result = sqldf(query)

print(result)

   Name  Age    City  count(*)
0  Jane   30  London         3